geosmall/Arduino_Core_STM32/boards.txt
# Blue F407VE mini: http://wiki.stm32duino.com/index.php?title=Vcc-gnd.com_STM32F407VET6_Mini
GenF4.menu.pnum.BLUE_F407VE_MINI=Blue F407VE mini
GenF4.menu.pnum.BLUE_F407VE_MINI.upload.maximum_size=524288
GenF4.menu.pnum.BLUE_F407VE_MINI.upload.maximum_data_size=131072
GenF4.menu.pnum.BLUE_F407VE_MINI.build.board=BLUE_F407VE_MINI
GenF4.menu.pnum.BLUE_F407VE_MINI.build.product_line=STM32F407xx
GenF4.menu.pnum.BLUE_F407VE_MINI.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.BLUE_F407VE_MINI.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
GenF4.menu.pnum.BLUE_F407VE_MINI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# DIYMORE STM32F407VGT board
GenF4.menu.pnum.DIYMORE_F407VGT=DIYMORE STM32F407VGT
GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_size=1048576
GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_data_size=131072
GenF4.menu.pnum.DIYMORE_F407VGT.build.board=DIYMORE_F407VGT
GenF4.menu.pnum.DIYMORE_F407VGT.build.product_line=STM32F407xx
GenF4.menu.pnum.DIYMORE_F407VGT.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
GenF4.menu.pnum.DIYMORE_F407VGT.build.variant_h=variant_{build.board}.h

# FK407M1
GenF4.menu.pnum.FK407M1=FK407M1 STM32F407VET
GenF4.menu.pnum.FK407M1.upload.maximum_size=524288
GenF4.menu.pnum.FK407M1.upload.maximum_data_size=131072
GenF4.menu.pnum.FK407M1.build.board=FK407M1
GenF4.menu.pnum.FK407M1.build.product_line=STM32F407xx
GenF4.menu.pnum.FK407M1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
GenF4.menu.pnum.FK407M1.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.FK407M1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# BlackPill F401CC
GenF4.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
GenF4.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
GenF4.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
GenF4.menu.pnum.BLACKPILL_F401CC.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.BLACKPILL_F401CC.build.variant_h=variant_BLACKPILL_F401Cx.h
GenF4.menu.pnum.BLACKPILL_F401CC.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# BlackPill F401CE
GenF4.menu.pnum.BLACKPILL_F401CE=BlackPill F401CE
GenF4.menu.pnum.BLACKPILL_F401CE.upload.maximum_size=524288
GenF4.menu.pnum.BLACKPILL_F401CE.upload.maximum_data_size=98304
GenF4.menu.pnum.BLACKPILL_F401CE.build.board=BLACKPILL_F401CE
GenF4.menu.pnum.BLACKPILL_F401CE.build.product_line=STM32F401xE
GenF4.menu.pnum.BLACKPILL_F401CE.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)
GenF4.menu.pnum.BLACKPILL_F401CE.build.variant_h=variant_BLACKPILL_F401Cx.h
GenF4.menu.pnum.BLACKPILL_F401CE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# BlackPill F411CE
# https://github.com/mcauser/WEACT_F411CEU6
GenF4.menu.pnum.BLACKPILL_F411CE=BlackPill F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_size=524288
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACKPILL_F411CE.build.board=BLACKPILL_F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.build.product_line=STM32F411xE
GenF4.menu.pnum.BLACKPILL_F411CE.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.BLACKPILL_F411CE.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.BLACKPILL_F411CE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Core board F401RCT6
# https://stm32-base.org/boards/STM32F401RCT6-STM32F-Core-Board
GenF4.menu.pnum.CoreBoard_F401RC=Core board F401RCT6
GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_size=262144
GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_data_size=65536
GenF4.menu.pnum.CoreBoard_F401RC.build.board=CoreBoard_F401RC
GenF4.menu.pnum.CoreBoard_F401RC.build.product_line=STM32F401xC
GenF4.menu.pnum.CoreBoard_F401RC.build.variant=STM32F4xx/F401R(B-C-D-E)T
GenF4.menu.pnum.CoreBoard_F401RC.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.CoreBoard_F401RC.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Adafruit Feather STM32F405 board
GenF4.menu.pnum.FEATHER_F405=Adafruit Feather STM32F405
GenF4.menu.pnum.FEATHER_F405.upload.maximum_size=1048576
GenF4.menu.pnum.FEATHER_F405.upload.maximum_data_size=131072
GenF4.menu.pnum.FEATHER_F405.build.board=FEATHER_F405
GenF4.menu.pnum.FEATHER_F405.build.product_line=STM32F405xx
GenF4.menu.pnum.FEATHER_F405.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.FEATHER_F405.build.variant=STM32F4xx/F405RGT_F415RGT
GenF4.menu.pnum.FEATHER_F405.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# ThunderPack F411xxE
# https://github.com/jgillick/ThunderPack/tree/STM32F4
GenF4.menu.pnum.THUNDERPACK_F411=ThunderPack v1.1+
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_size=524288
GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_data_size=131072
GenF4.menu.pnum.THUNDERPACK_F411.build.board=THUNDERPACK_F411
GenF4.menu.pnum.THUNDERPACK_F411.build.product_line=STM32F411xE
GenF4.menu.pnum.THUNDERPACK_F411.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.THUNDERPACK_F411.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.THUNDERPACK_F411.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# VCCGND_F407ZGT6 board
GenF4.menu.pnum.VCCGND_F407ZG_MINI=VCCGND F407ZGT6 Mini
GenF4.menu.pnum.VCCGND_F407ZG_MINI.upload.maximum_size=1048576
GenF4.menu.pnum.VCCGND_F407ZG_MINI.upload.maximum_data_size=131072
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.board=VCCGND_F407ZG_MINI
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.product_line=STM32F407xx
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T
GenF4.menu.pnum.VCCGND_F407ZG_MINI.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Generic F401CBUx
GenF4.menu.pnum.GENERIC_F401CBUX=Generic F401CBUx
GenF4.menu.pnum.GENERIC_F401CBUX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401CBUX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CBUX.build.board=GENERIC_F401CBUX
GenF4.menu.pnum.GENERIC_F401CBUX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CBUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CCUx
GenF4.menu.pnum.GENERIC_F401CCUX=Generic F401CCUx
GenF4.menu.pnum.GENERIC_F401CCUX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCUX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCUX.build.board=GENERIC_F401CCUX
GenF4.menu.pnum.GENERIC_F401CCUX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CBYx
GenF4.menu.pnum.GENERIC_F401CBYX=Generic F401CBYx
GenF4.menu.pnum.GENERIC_F401CBYX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401CBYX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CBYX.build.board=GENERIC_F401CBYX
GenF4.menu.pnum.GENERIC_F401CBYX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CBYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CCYx
GenF4.menu.pnum.GENERIC_F401CCYX=Generic F401CCYx
GenF4.menu.pnum.GENERIC_F401CCYX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCYX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCYX.build.board=GENERIC_F401CCYX
GenF4.menu.pnum.GENERIC_F401CCYX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

