geosmall/Arduino_Core_STM32/boards.txt
# Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX=Generic F412CGUx
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412CGUX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412CGUX.build.board=GENERIC_F412CGUX
GenF4.menu.pnum.GENERIC_F412CGUX.build.product_line=STM32F412Cx
GenF4.menu.pnum.GENERIC_F412CGUX.build.variant=STM32F4xx/F412C(E-G)U

# Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX=Generic F412RETx
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412RETX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RETX.build.board=GENERIC_F412RETX
GenF4.menu.pnum.GENERIC_F412RETX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RETX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX=Generic F412RGTx
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGTX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGTX.build.board=GENERIC_F412RGTX
GenF4.menu.pnum.GENERIC_F412RGTX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGTX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412REYx
GenF4.menu.pnum.GENERIC_F412REYX=Generic F412REYx
GenF4.menu.pnum.GENERIC_F412REYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412REYX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412REYX.build.board=GENERIC_F412REYX
GenF4.menu.pnum.GENERIC_F412REYX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412REYX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGYx
GenF4.menu.pnum.GENERIC_F412RGYX=Generic F412RGYx
GenF4.menu.pnum.GENERIC_F412RGYX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGYX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGYX.build.board=GENERIC_F412RGYX
GenF4.menu.pnum.GENERIC_F412RGYX.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGYX.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412REYxP
GenF4.menu.pnum.GENERIC_F412REYXP=Generic F412REYxP
GenF4.menu.pnum.GENERIC_F412REYXP.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412REYXP.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412REYXP.build.board=GENERIC_F412REYXP
GenF4.menu.pnum.GENERIC_F412REYXP.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412REYXP.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412RGYxP
GenF4.menu.pnum.GENERIC_F412RGYXP=Generic F412RGYxP
GenF4.menu.pnum.GENERIC_F412RGYXP.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412RGYXP.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412RGYXP.build.board=GENERIC_F412RGYXP
GenF4.menu.pnum.GENERIC_F412RGYXP.build.product_line=STM32F412Rx
GenF4.menu.pnum.GENERIC_F412RGYXP.build.variant=STM32F4xx/F412R(E-G)(T-Y)x(P)

# Generic F412ZEJx
GenF4.menu.pnum.GENERIC_F412ZEJX=Generic F412ZEJx
GenF4.menu.pnum.GENERIC_F412ZEJX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412ZEJX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZEJX.build.board=GENERIC_F412ZEJX
GenF4.menu.pnum.GENERIC_F412ZEJX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZEJX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F412ZGJx
GenF4.menu.pnum.GENERIC_F412ZGJX=Generic F412ZGJx
GenF4.menu.pnum.GENERIC_F412ZGJX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412ZGJX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZGJX.build.board=GENERIC_F412ZGJX
GenF4.menu.pnum.GENERIC_F412ZGJX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZGJX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F412ZETx
GenF4.menu.pnum.GENERIC_F412ZETX=Generic F412ZETx
GenF4.menu.pnum.GENERIC_F412ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F412ZETX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZETX.build.board=GENERIC_F412ZETX
GenF4.menu.pnum.GENERIC_F412ZETX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZETX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F412ZGTx
GenF4.menu.pnum.GENERIC_F412ZGTX=Generic F412ZGTx
GenF4.menu.pnum.GENERIC_F412ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F412ZGTX.upload.maximum_data_size=262144
GenF4.menu.pnum.GENERIC_F412ZGTX.build.board=GENERIC_F412ZGTX
GenF4.menu.pnum.GENERIC_F412ZGTX.build.product_line=STM32F412Zx
GenF4.menu.pnum.GENERIC_F412ZGTX.build.variant=STM32F4xx/F412Z(E-G)(J-T)

# Generic F413CGUx
GenF4.menu.pnum.GENERIC_F413CGUX=Generic F413CGUx
GenF4.menu.pnum.GENERIC_F413CGUX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413CGUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413CGUX.build.board=GENERIC_F413CGUX
GenF4.menu.pnum.GENERIC_F413CGUX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413CGUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

# Generic F413CHUx
GenF4.menu.pnum.GENERIC_F413CHUX=Generic F413CHUx
GenF4.menu.pnum.GENERIC_F413CHUX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413CHUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413CHUX.build.board=GENERIC_F413CHUX
GenF4.menu.pnum.GENERIC_F413CHUX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413CHUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

# Generic F413RGTx
GenF4.menu.pnum.GENERIC_F413RGTX=Generic F413RGTx
GenF4.menu.pnum.GENERIC_F413RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413RGTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413RGTX.build.board=GENERIC_F413RGTX
GenF4.menu.pnum.GENERIC_F413RGTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413RGTX.build.variant=STM32F4xx/F413R(G-H)T_F423RHT

# Generic F413RHTx
GenF4.menu.pnum.GENERIC_F413RHTX=Generic F413RHTx
GenF4.menu.pnum.GENERIC_F413RHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413RHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413RHTX.build.board=GENERIC_F413RHTX
GenF4.menu.pnum.GENERIC_F413RHTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413RHTX.build.variant=STM32F4xx/F413R(G-H)T_F423RHT

# Generic F413ZGJx
GenF4.menu.pnum.GENERIC_F413ZGJX=Generic F413ZGJx
GenF4.menu.pnum.GENERIC_F413ZGJX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413ZGJX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZGJX.build.board=GENERIC_F413ZGJX
GenF4.menu.pnum.GENERIC_F413ZGJX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZGJX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F413ZHJx
GenF4.menu.pnum.GENERIC_F413ZHJX=Generic F413ZHJx
GenF4.menu.pnum.GENERIC_F413ZHJX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413ZHJX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZHJX.build.board=GENERIC_F413ZHJX
GenF4.menu.pnum.GENERIC_F413ZHJX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZHJX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

