geosmall/Arduino_Core_STM32/boards.txt
# Generic F413ZGTx
GenF4.menu.pnum.GENERIC_F413ZGTX=Generic F413ZGTx
GenF4.menu.pnum.GENERIC_F413ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F413ZGTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZGTX.build.board=GENERIC_F413ZGTX
GenF4.menu.pnum.GENERIC_F413ZGTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZGTX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F413ZHTx
GenF4.menu.pnum.GENERIC_F413ZHTX=Generic F413ZHTx
GenF4.menu.pnum.GENERIC_F413ZHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F413ZHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F413ZHTX.build.board=GENERIC_F413ZHTX
GenF4.menu.pnum.GENERIC_F413ZHTX.build.product_line=STM32F413xx
GenF4.menu.pnum.GENERIC_F413ZHTX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F415RGTx
GenF4.menu.pnum.GENERIC_F415RGTX=Generic F415RGTx
GenF4.menu.pnum.GENERIC_F415RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F415RGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F415RGTX.build.board=GENERIC_F415RGTX
GenF4.menu.pnum.GENERIC_F415RGTX.build.product_line=STM32F415xx
GenF4.menu.pnum.GENERIC_F415RGTX.build.variant=STM32F4xx/F405RGT_F415RGT

# Generic F417VETx
GenF4.menu.pnum.GENERIC_F417VETX=Generic F417VETx
GenF4.menu.pnum.GENERIC_F417VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F417VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417VETX.build.board=GENERIC_F417VETX
GenF4.menu.pnum.GENERIC_F417VETX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417VETX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F417VGTx
GenF4.menu.pnum.GENERIC_F417VGTX=Generic F417VGTx
GenF4.menu.pnum.GENERIC_F417VGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F417VGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417VGTX.build.board=GENERIC_F417VGTX
GenF4.menu.pnum.GENERIC_F417VGTX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417VGTX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F417ZETx
GenF4.menu.pnum.GENERIC_F417ZETX=Generic F417ZETx
GenF4.menu.pnum.GENERIC_F417ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F417ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417ZETX.build.board=GENERIC_F417ZETX
GenF4.menu.pnum.GENERIC_F417ZETX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417ZETX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F417ZGTx
GenF4.menu.pnum.GENERIC_F417ZGTX=Generic F417ZGTx
GenF4.menu.pnum.GENERIC_F417ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F417ZGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F417ZGTX.build.board=GENERIC_F417ZGTX
GenF4.menu.pnum.GENERIC_F417ZGTX.build.product_line=STM32F417xx
GenF4.menu.pnum.GENERIC_F417ZGTX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F423CHUx
GenF4.menu.pnum.GENERIC_F423CHUX=Generic F423CHUx
GenF4.menu.pnum.GENERIC_F423CHUX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F423CHUX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F423CHUX.build.board=GENERIC_F423CHUX
GenF4.menu.pnum.GENERIC_F423CHUX.build.product_line=STM32F423xx
GenF4.menu.pnum.GENERIC_F423CHUX.build.variant=STM32F4xx/F413C(G-H)U_F423CHU

# Generic F423RHTx
GenF4.menu.pnum.GENERIC_F423RHTX=Generic F423RHTx
GenF4.menu.pnum.GENERIC_F423RHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F423RHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F423RHTX.build.board=GENERIC_F423RHTX
GenF4.menu.pnum.GENERIC_F423RHTX.build.product_line=STM32F423xx
GenF4.menu.pnum.GENERIC_F423RHTX.build.variant=STM32F4xx/F413R(G-H)T_F423RHT

# Generic F423ZHJx
GenF4.menu.pnum.GENERIC_F423ZHJX=Generic F423ZHJx
GenF4.menu.pnum.GENERIC_F423ZHJX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F423ZHJX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F423ZHJX.build.board=GENERIC_F423ZHJX
GenF4.menu.pnum.GENERIC_F423ZHJX.build.product_line=STM32F423xx
GenF4.menu.pnum.GENERIC_F423ZHJX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F423ZHTx
GenF4.menu.pnum.GENERIC_F423ZHTX=Generic F423ZHTx
GenF4.menu.pnum.GENERIC_F423ZHTX.upload.maximum_size=1572864
GenF4.menu.pnum.GENERIC_F423ZHTX.upload.maximum_data_size=327680
GenF4.menu.pnum.GENERIC_F423ZHTX.build.board=GENERIC_F423ZHTX
GenF4.menu.pnum.GENERIC_F423ZHTX.build.product_line=STM32F423xx
GenF4.menu.pnum.GENERIC_F423ZHTX.build.variant=STM32F4xx/F413Z(G-H)(J-T)_F423ZH(J-T)

# Generic F427ZGTx
GenF4.menu.pnum.GENERIC_F427ZGTX=Generic F427ZGTx
GenF4.menu.pnum.GENERIC_F427ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F427ZGTX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F427ZGTX.build.board=GENERIC_F427ZGTX
GenF4.menu.pnum.GENERIC_F427ZGTX.build.product_line=STM32F427xx
GenF4.menu.pnum.GENERIC_F427ZGTX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F427ZITx
GenF4.menu.pnum.GENERIC_F427ZITX=Generic F427ZITx
GenF4.menu.pnum.GENERIC_F427ZITX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F427ZITX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F427ZITX.build.board=GENERIC_F427ZITX
GenF4.menu.pnum.GENERIC_F427ZITX.build.product_line=STM32F427xx
GenF4.menu.pnum.GENERIC_F427ZITX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F429ZETx
GenF4.menu.pnum.GENERIC_F429ZETX=Generic F429ZETx
GenF4.menu.pnum.GENERIC_F429ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F429ZETX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F429ZETX.build.board=GENERIC_F429ZETX
GenF4.menu.pnum.GENERIC_F429ZETX.build.product_line=STM32F429xx
GenF4.menu.pnum.GENERIC_F429ZETX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F429ZGTx
GenF4.menu.pnum.GENERIC_F429ZGTX=Generic F429ZGTx
GenF4.menu.pnum.GENERIC_F429ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F429ZGTX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F429ZGTX.build.board=GENERIC_F429ZGTX
GenF4.menu.pnum.GENERIC_F429ZGTX.build.product_line=STM32F429xx
GenF4.menu.pnum.GENERIC_F429ZGTX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F429ZGYx
GenF4.menu.pnum.GENERIC_F429ZGYX=Generic F429ZGYx
GenF4.menu.pnum.GENERIC_F429ZGYX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F429ZGYX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F429ZGYX.build.board=GENERIC_F429ZGYX
GenF4.menu.pnum.GENERIC_F429ZGYX.build.product_line=STM32F429xx
GenF4.menu.pnum.GENERIC_F429ZGYX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F429ZITx
GenF4.menu.pnum.GENERIC_F429ZITX=Generic F429ZITx
GenF4.menu.pnum.GENERIC_F429ZITX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F429ZITX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F429ZITX.build.board=GENERIC_F429ZITX
GenF4.menu.pnum.GENERIC_F429ZITX.build.product_line=STM32F429xx
GenF4.menu.pnum.GENERIC_F429ZITX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

