geosmall/Arduino_Core_STM32/boards.txt
# Generic F429ZIYx
GenF4.menu.pnum.GENERIC_F429ZIYX=Generic F429ZIYx
GenF4.menu.pnum.GENERIC_F429ZIYX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F429ZIYX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F429ZIYX.build.board=GENERIC_F429ZIYX
GenF4.menu.pnum.GENERIC_F429ZIYX.build.product_line=STM32F429xx
GenF4.menu.pnum.GENERIC_F429ZIYX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F437ZGTx
GenF4.menu.pnum.GENERIC_F437ZGTX=Generic F437ZGTx
GenF4.menu.pnum.GENERIC_F437ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F437ZGTX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F437ZGTX.build.board=GENERIC_F437ZGTX
GenF4.menu.pnum.GENERIC_F437ZGTX.build.product_line=STM32F437xx
GenF4.menu.pnum.GENERIC_F437ZGTX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F437ZITx
GenF4.menu.pnum.GENERIC_F437ZITX=Generic F437ZITx
GenF4.menu.pnum.GENERIC_F437ZITX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F437ZITX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F437ZITX.build.board=GENERIC_F437ZITX
GenF4.menu.pnum.GENERIC_F437ZITX.build.product_line=STM32F437xx
GenF4.menu.pnum.GENERIC_F437ZITX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F439ZGTx
GenF4.menu.pnum.GENERIC_F439ZGTX=Generic F439ZGTx
GenF4.menu.pnum.GENERIC_F439ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F439ZGTX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F439ZGTX.build.board=GENERIC_F439ZGTX
GenF4.menu.pnum.GENERIC_F439ZGTX.build.product_line=STM32F439xx
GenF4.menu.pnum.GENERIC_F439ZGTX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F439ZITx
GenF4.menu.pnum.GENERIC_F439ZITX=Generic F439ZITx
GenF4.menu.pnum.GENERIC_F439ZITX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F439ZITX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F439ZITX.build.board=GENERIC_F439ZITX
GenF4.menu.pnum.GENERIC_F439ZITX.build.product_line=STM32F439xx
GenF4.menu.pnum.GENERIC_F439ZITX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F439ZGYx
GenF4.menu.pnum.GENERIC_F439ZGYX=Generic F439ZGYx
GenF4.menu.pnum.GENERIC_F439ZGYX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F439ZGYX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F439ZGYX.build.board=GENERIC_F439ZGYX
GenF4.menu.pnum.GENERIC_F439ZGYX.build.product_line=STM32F439xx
GenF4.menu.pnum.GENERIC_F439ZGYX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F439ZIYx
GenF4.menu.pnum.GENERIC_F439ZIYX=Generic F439ZIYx
GenF4.menu.pnum.GENERIC_F439ZIYX.upload.maximum_size=2097152
GenF4.menu.pnum.GENERIC_F439ZIYX.upload.maximum_data_size=196608
GenF4.menu.pnum.GENERIC_F439ZIYX.build.board=GENERIC_F439ZIYX
GenF4.menu.pnum.GENERIC_F439ZIYX.build.product_line=STM32F439xx
GenF4.menu.pnum.GENERIC_F439ZIYX.build.variant=STM32F4xx/F427Z(G-I)T_F429ZET_F429Z(G-I)(T-Y)_F437Z(G-I)T_F439Z(G-I)(T-Y)

# Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX=Generic F446RCTx
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446RCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RCTX.build.board=GENERIC_F446RCTX
GenF4.menu.pnum.GENERIC_F446RCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RCTX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX=Generic F446RETx
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446RETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446RETX.build.board=GENERIC_F446RETX
GenF4.menu.pnum.GENERIC_F446RETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446RETX.build.variant=STM32F4xx/F446R(C-E)T

# Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX=Generic F446VCTx
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446VCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VCTX.build.board=GENERIC_F446VCTX
GenF4.menu.pnum.GENERIC_F446VCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VCTX.build.variant=STM32F4xx/F446V(C-E)T

# Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX=Generic F446VETx
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446VETX.build.board=GENERIC_F446VETX
GenF4.menu.pnum.GENERIC_F446VETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446VETX.build.variant=STM32F4xx/F446V(C-E)T

# Generic F446ZCHx
GenF4.menu.pnum.GENERIC_F446ZCHX=Generic F446ZCHx
GenF4.menu.pnum.GENERIC_F446ZCHX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCHX.build.board=GENERIC_F446ZCHX
GenF4.menu.pnum.GENERIC_F446ZCHX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCHX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZCJx
GenF4.menu.pnum.GENERIC_F446ZCJX=Generic F446ZCJx
GenF4.menu.pnum.GENERIC_F446ZCJX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCJX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCJX.build.board=GENERIC_F446ZCJX
GenF4.menu.pnum.GENERIC_F446ZCJX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCJX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZCTx
GenF4.menu.pnum.GENERIC_F446ZCTX=Generic F446ZCTx
GenF4.menu.pnum.GENERIC_F446ZCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F446ZCTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZCTX.build.board=GENERIC_F446ZCTX
GenF4.menu.pnum.GENERIC_F446ZCTX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZCTX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZEHx
GenF4.menu.pnum.GENERIC_F446ZEHX=Generic F446ZEHx
GenF4.menu.pnum.GENERIC_F446ZEHX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZEHX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZEHX.build.board=GENERIC_F446ZEHX
GenF4.menu.pnum.GENERIC_F446ZEHX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZEHX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZEJx
GenF4.menu.pnum.GENERIC_F446ZEJX=Generic F446ZEJx
GenF4.menu.pnum.GENERIC_F446ZEJX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZEJX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZEJX.build.board=GENERIC_F446ZEJX
GenF4.menu.pnum.GENERIC_F446ZEJX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZEJX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Generic F446ZETx
GenF4.menu.pnum.GENERIC_F446ZETX=Generic F446ZETx
GenF4.menu.pnum.GENERIC_F446ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F446ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F446ZETX.build.board=GENERIC_F446ZETX
GenF4.menu.pnum.GENERIC_F446ZETX.build.product_line=STM32F446xx
GenF4.menu.pnum.GENERIC_F446ZETX.build.variant=STM32F4xx/F446Z(C-E)(H-J-T)

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

