geosmall/Arduino_Core_STM32/boards.txt
GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

################################################################################
# Generic F7

GenF7.name=Generic STM32F7 series

GenF7.build.core=arduino
GenF7.build.board=GenF7
GenF7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF7.build.mcu=cortex-m7
GenF7.build.fpu=-mfpu=fpv4-sp-d16
GenF7.build.float-abi=-mfloat-abi=hard
GenF7.build.series=STM32F7xx
GenF7.build.flash_offset=0x0
GenF7.upload.maximum_size=0
GenF7.upload.maximum_data_size=0

# Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX=Generic F722RCTx
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F722RCTX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722RCTX.build.board=GENERIC_F722RCTX
GenF7.menu.pnum.GENERIC_F722RCTX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RCTX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX=Generic F722RETx
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F722RETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722RETX.build.board=GENERIC_F722RETX
GenF7.menu.pnum.GENERIC_F722RETX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722RETX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F722ZCTx
GenF7.menu.pnum.GENERIC_F722ZCTX=Generic F722ZCTx
GenF7.menu.pnum.GENERIC_F722ZCTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F722ZCTX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722ZCTX.build.board=GENERIC_F722ZCTX
GenF7.menu.pnum.GENERIC_F722ZCTX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722ZCTX.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET

# Generic F722ZETx
GenF7.menu.pnum.GENERIC_F722ZETX=Generic F722ZETx
GenF7.menu.pnum.GENERIC_F722ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F722ZETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F722ZETX.build.board=GENERIC_F722ZETX
GenF7.menu.pnum.GENERIC_F722ZETX.build.product_line=STM32F722xx
GenF7.menu.pnum.GENERIC_F722ZETX.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET

# Generic F723ICKx
GenF7.menu.pnum.GENERIC_F723ICKX=Generic F723ICKx
GenF7.menu.pnum.GENERIC_F723ICKX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F723ICKX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F723ICKX.build.board=GENERIC_F723ICKX
GenF7.menu.pnum.GENERIC_F723ICKX.build.product_line=STM32F723xx
GenF7.menu.pnum.GENERIC_F723ICKX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F723ICTx
GenF7.menu.pnum.GENERIC_F723ICTX=Generic F723ICTx
GenF7.menu.pnum.GENERIC_F723ICTX.upload.maximum_size=262144
GenF7.menu.pnum.GENERIC_F723ICTX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F723ICTX.build.board=GENERIC_F723ICTX
GenF7.menu.pnum.GENERIC_F723ICTX.build.product_line=STM32F723xx
GenF7.menu.pnum.GENERIC_F723ICTX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F723IEKx
GenF7.menu.pnum.GENERIC_F723IEKX=Generic F723IEKx
GenF7.menu.pnum.GENERIC_F723IEKX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F723IEKX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F723IEKX.build.board=GENERIC_F723IEKX
GenF7.menu.pnum.GENERIC_F723IEKX.build.product_line=STM32F723xx
GenF7.menu.pnum.GENERIC_F723IEKX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F723IETx
GenF7.menu.pnum.GENERIC_F723IETX=Generic F723IETx
GenF7.menu.pnum.GENERIC_F723IETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F723IETX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F723IETX.build.board=GENERIC_F723IETX
GenF7.menu.pnum.GENERIC_F723IETX.build.product_line=STM32F723xx
GenF7.menu.pnum.GENERIC_F723IETX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F730I8Kx
GenF7.menu.pnum.GENERIC_F730I8KX=Generic F730I8Kx
GenF7.menu.pnum.GENERIC_F730I8KX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F730I8KX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F730I8KX.build.board=GENERIC_F730I8KX
GenF7.menu.pnum.GENERIC_F730I8KX.build.product_line=STM32F730xx
GenF7.menu.pnum.GENERIC_F730I8KX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F730R8Tx
GenF7.menu.pnum.GENERIC_F730R8TX=Generic F730R8Tx
GenF7.menu.pnum.GENERIC_F730R8TX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F730R8TX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F730R8TX.build.board=GENERIC_F730R8TX
GenF7.menu.pnum.GENERIC_F730R8TX.build.product_line=STM32F730xx
GenF7.menu.pnum.GENERIC_F730R8TX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F732RETx
GenF7.menu.pnum.GENERIC_F732RETX=Generic F732RETx
GenF7.menu.pnum.GENERIC_F732RETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F732RETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F732RETX.build.board=GENERIC_F732RETX
GenF7.menu.pnum.GENERIC_F732RETX.build.product_line=STM32F732xx
GenF7.menu.pnum.GENERIC_F732RETX.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET

# Generic F732ZETx
GenF7.menu.pnum.GENERIC_F732ZETX=Generic F732ZETx
GenF7.menu.pnum.GENERIC_F732ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F732ZETX.upload.maximum_data_size=262144
GenF7.menu.pnum.GENERIC_F732ZETX.build.board=GENERIC_F732ZETX
GenF7.menu.pnum.GENERIC_F732ZETX.build.product_line=STM32F732xx
GenF7.menu.pnum.GENERIC_F732ZETX.build.variant=STM32F7xx/F722Z(C-E)T_F732ZET

# Generic F733IEKx
GenF7.menu.pnum.GENERIC_F733IEKX=Generic F733IEKx
GenF7.menu.pnum.GENERIC_F733IEKX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F733IEKX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F733IEKX.build.board=GENERIC_F733IEKX
GenF7.menu.pnum.GENERIC_F733IEKX.build.product_line=STM32F733xx
GenF7.menu.pnum.GENERIC_F733IEKX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

# Generic F733IETx
GenF7.menu.pnum.GENERIC_F733IETX=Generic F733IETx
GenF7.menu.pnum.GENERIC_F733IETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F733IETX.upload.maximum_data_size=196608
GenF7.menu.pnum.GENERIC_F733IETX.build.board=GENERIC_F733IETX
GenF7.menu.pnum.GENERIC_F733IETX.build.product_line=STM32F733xx
GenF7.menu.pnum.GENERIC_F733IETX.build.variant=STM32F7xx/F723I(C-E)(K-T)_F730I8K_F733IE(K-T)

