geosmall/Arduino_Core_STM32/boards.txt
# Generic F745ZETx
GenF7.menu.pnum.GENERIC_F745ZETX=Generic F745ZETx
GenF7.menu.pnum.GENERIC_F745ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F745ZETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F745ZETX.build.board=GENERIC_F745ZETX
GenF7.menu.pnum.GENERIC_F745ZETX.build.product_line=STM32F745xx
GenF7.menu.pnum.GENERIC_F745ZETX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F745ZGTx
GenF7.menu.pnum.GENERIC_F745ZGTX=Generic F745ZGTx
GenF7.menu.pnum.GENERIC_F745ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F745ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F745ZGTX.build.board=GENERIC_F745ZGTX
GenF7.menu.pnum.GENERIC_F745ZGTX.build.product_line=STM32F745xx
GenF7.menu.pnum.GENERIC_F745ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746BETx
GenF7.menu.pnum.GENERIC_F746BETX=Generic F746BETx
GenF7.menu.pnum.GENERIC_F746BETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746BETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746BETX.build.board=GENERIC_F746BETX
GenF7.menu.pnum.GENERIC_F746BETX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746BETX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746BGTx
GenF7.menu.pnum.GENERIC_F746BGTX=Generic F746BGTx
GenF7.menu.pnum.GENERIC_F746BGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746BGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746BGTX.build.board=GENERIC_F746BGTX
GenF7.menu.pnum.GENERIC_F746BGTX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746BGTX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746NEHx
GenF7.menu.pnum.GENERIC_F746NEHX=Generic F746NEHx
GenF7.menu.pnum.GENERIC_F746NEHX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746NEHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746NEHX.build.board=GENERIC_F746NEHX
GenF7.menu.pnum.GENERIC_F746NEHX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746NEHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746NGHx
GenF7.menu.pnum.GENERIC_F746NGHX=Generic F746NGHx
GenF7.menu.pnum.GENERIC_F746NGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746NGHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746NGHX.build.board=GENERIC_F746NGHX
GenF7.menu.pnum.GENERIC_F746NGHX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746NGHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F746ZETx
GenF7.menu.pnum.GENERIC_F746ZETX=Generic F746ZETx
GenF7.menu.pnum.GENERIC_F746ZETX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746ZETX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZETX.build.board=GENERIC_F746ZETX
GenF7.menu.pnum.GENERIC_F746ZETX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZETX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZEYx
GenF7.menu.pnum.GENERIC_F746ZEYX=Generic F746ZEYx
GenF7.menu.pnum.GENERIC_F746ZEYX.upload.maximum_size=524288
GenF7.menu.pnum.GENERIC_F746ZEYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZEYX.build.board=GENERIC_F746ZEYX
GenF7.menu.pnum.GENERIC_F746ZEYX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZEYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZGTx
GenF7.menu.pnum.GENERIC_F746ZGTX=Generic F746ZGTx
GenF7.menu.pnum.GENERIC_F746ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZGTX.build.board=GENERIC_F746ZGTX
GenF7.menu.pnum.GENERIC_F746ZGTX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F746ZGYx
GenF7.menu.pnum.GENERIC_F746ZGYX=Generic F746ZGYx
GenF7.menu.pnum.GENERIC_F746ZGYX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F746ZGYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F746ZGYX.build.board=GENERIC_F746ZGYX
GenF7.menu.pnum.GENERIC_F746ZGYX.build.product_line=STM32F746xx
GenF7.menu.pnum.GENERIC_F746ZGYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F750N8Hx
GenF7.menu.pnum.GENERIC_F750N8HX=Generic F750N8Hx
GenF7.menu.pnum.GENERIC_F750N8HX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F750N8HX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F750N8HX.build.board=GENERIC_F750N8HX
GenF7.menu.pnum.GENERIC_F750N8HX.build.product_line=STM32F750xx
GenF7.menu.pnum.GENERIC_F750N8HX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F750Z8Tx
GenF7.menu.pnum.GENERIC_F750Z8TX=Generic F750Z8Tx
GenF7.menu.pnum.GENERIC_F750Z8TX.upload.maximum_size=65536
GenF7.menu.pnum.GENERIC_F750Z8TX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F750Z8TX.build.board=GENERIC_F750Z8TX
GenF7.menu.pnum.GENERIC_F750Z8TX.build.product_line=STM32F750xx
GenF7.menu.pnum.GENERIC_F750Z8TX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F756BGTx
GenF7.menu.pnum.GENERIC_F756BGTX=Generic F756BGTx
GenF7.menu.pnum.GENERIC_F756BGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756BGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756BGTX.build.board=GENERIC_F756BGTX
GenF7.menu.pnum.GENERIC_F756BGTX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756BGTX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F756NGHx
GenF7.menu.pnum.GENERIC_F756NGHX=Generic F756NGHx
GenF7.menu.pnum.GENERIC_F756NGHX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756NGHX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756NGHX.build.board=GENERIC_F756NGHX
GenF7.menu.pnum.GENERIC_F756NGHX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756NGHX.build.variant=STM32F7xx/F746B(E-G)T_F746N(E-G)H_F750N8H_F756BGT_F756NGH

# Generic F756ZGTx
GenF7.menu.pnum.GENERIC_F756ZGTX=Generic F756ZGTx
GenF7.menu.pnum.GENERIC_F756ZGTX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756ZGTX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756ZGTX.build.board=GENERIC_F756ZGTX
GenF7.menu.pnum.GENERIC_F756ZGTX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756ZGTX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F756ZGYx
GenF7.menu.pnum.GENERIC_F756ZGYX=Generic F756ZGYx
GenF7.menu.pnum.GENERIC_F756ZGYX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F756ZGYX.upload.maximum_data_size=327680
GenF7.menu.pnum.GENERIC_F756ZGYX.build.board=GENERIC_F756ZGYX
GenF7.menu.pnum.GENERIC_F756ZGYX.build.product_line=STM32F756xx
GenF7.menu.pnum.GENERIC_F756ZGYX.build.variant=STM32F7xx/F745Z(E-G)T_F746Z(E-G)(T-Y)_F750Z8T_F756ZG(T-Y)

# Generic F765IGKx
GenF7.menu.pnum.GENERIC_F765IGKX=Generic F765IGKx
GenF7.menu.pnum.GENERIC_F765IGKX.upload.maximum_size=1048576
GenF7.menu.pnum.GENERIC_F765IGKX.upload.maximum_data_size=393216
GenF7.menu.pnum.GENERIC_F765IGKX.build.board=GENERIC_F765IGKX
GenF7.menu.pnum.GENERIC_F765IGKX.build.product_line=STM32F765xx
GenF7.menu.pnum.GENERIC_F765IGKX.build.variant=STM32F7xx/F765I(G-I)(K-T)_F767I(G-I)(K-T)_F777II(K-T)

