geosmall/Arduino_Core_STM32/boards.txt
GenF7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF7.menu.upload_method.serialMethod.upload.protocol=1
GenF7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF7.menu.upload_method.dfuMethod.upload.protocol=2
GenF7.menu.upload_method.dfuMethod.upload.options=
GenF7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

###############################
# Generic G4
GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.fpu=-mfpu=fpv4-sp-d16
GenG4.build.float-abi=-mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.flash_offset=0x0
GenG4.upload.maximum_size=0
GenG4.upload.maximum_data_size=0

# Generic G431C6Tx
GenG4.menu.pnum.GENERIC_G431C6TX=Generic G431C6Tx
GenG4.menu.pnum.GENERIC_G431C6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6TX.build.board=GENERIC_G431C6TX
GenG4.menu.pnum.GENERIC_G431C6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6TX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT

# Generic G431C8Tx
GenG4.menu.pnum.GENERIC_G431C8TX=Generic G431C8Tx
GenG4.menu.pnum.GENERIC_G431C8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431C8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C8TX.build.board=GENERIC_G431C8TX
GenG4.menu.pnum.GENERIC_G431C8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C8TX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT

# Generic G431CBTx
GenG4.menu.pnum.GENERIC_G431CBTX=Generic G431CBTx
GenG4.menu.pnum.GENERIC_G431CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431CBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431CBTX.build.board=GENERIC_G431CBTX
GenG4.menu.pnum.GENERIC_G431CBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431CBTX.build.variant=STM32G4xx/G431C(6-8-B)T_G441CBT

# Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX=Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.build.board=GENERIC_G431C6UX
GenG4.menu.pnum.GENERIC_G431C6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX=Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C8UX.build.board=GENERIC_G431C8UX
GenG4.menu.pnum.GENERIC_G431C8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C8UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX=Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431CBUX.build.board=GENERIC_G431CBUX
GenG4.menu.pnum.GENERIC_G431CBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431K6Tx
GenG4.menu.pnum.GENERIC_G431K6TX=Generic G431K6Tx
GenG4.menu.pnum.GENERIC_G431K6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431K6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K6TX.build.board=GENERIC_G431K6TX
GenG4.menu.pnum.GENERIC_G431K6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K6TX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K8Tx
GenG4.menu.pnum.GENERIC_G431K8TX=Generic G431K8Tx
GenG4.menu.pnum.GENERIC_G431K8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431K8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K8TX.build.board=GENERIC_G431K8TX
GenG4.menu.pnum.GENERIC_G431K8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K8TX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX=Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBTX.build.board=GENERIC_G431KBTX
GenG4.menu.pnum.GENERIC_G431KBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBTX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX=Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.build.board=GENERIC_G431K6UX
GenG4.menu.pnum.GENERIC_G431K6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K6UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX=Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K8UX.build.board=GENERIC_G431K8UX
GenG4.menu.pnum.GENERIC_G431K8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K8UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX=Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBUX.build.board=GENERIC_G431KBUX
GenG4.menu.pnum.GENERIC_G431KBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBUX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431M6Tx
GenG4.menu.pnum.GENERIC_G431M6TX=Generic G431M6Tx
GenG4.menu.pnum.GENERIC_G431M6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431M6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431M6TX.build.board=GENERIC_G431M6TX
GenG4.menu.pnum.GENERIC_G431M6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431M6TX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT

# Generic G431M8Tx
GenG4.menu.pnum.GENERIC_G431M8TX=Generic G431M8Tx
GenG4.menu.pnum.GENERIC_G431M8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431M8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431M8TX.build.board=GENERIC_G431M8TX
GenG4.menu.pnum.GENERIC_G431M8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431M8TX.build.variant=STM32G4xx/G431M(6-8-B)T_G441MBT

