geosmall/Arduino_Core_STM32/boards.txt
# Generic G471CETx
GenG4.menu.pnum.GENERIC_G471CETX=Generic G471CETx
GenG4.menu.pnum.GENERIC_G471CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471CETX.build.board=GENERIC_G471CETX
GenG4.menu.pnum.GENERIC_G471CETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471CETX.build.variant=STM32G4xx/G471C(C-E)T

# Generic G471MCTx
GenG4.menu.pnum.GENERIC_G471MCTX=Generic G471MCTx
GenG4.menu.pnum.GENERIC_G471MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471MCTX.build.board=GENERIC_G471MCTX
GenG4.menu.pnum.GENERIC_G471MCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471MCTX.build.variant=STM32G4xx/G471M(C-E)T

# Generic G471METx
GenG4.menu.pnum.GENERIC_G471METX=Generic G471METx
GenG4.menu.pnum.GENERIC_G471METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471METX.build.board=GENERIC_G471METX
GenG4.menu.pnum.GENERIC_G471METX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471METX.build.variant=STM32G4xx/G471M(C-E)T

# Generic G471QCTx
GenG4.menu.pnum.GENERIC_G471QCTX=Generic G471QCTx
GenG4.menu.pnum.GENERIC_G471QCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471QCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471QCTX.build.board=GENERIC_G471QCTX
GenG4.menu.pnum.GENERIC_G471QCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471QCTX.build.variant=STM32G4xx/G471Q(C-E)T

# Generic G471QETx
GenG4.menu.pnum.GENERIC_G471QETX=Generic G471QETx
GenG4.menu.pnum.GENERIC_G471QETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471QETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471QETX.build.board=GENERIC_G471QETX
GenG4.menu.pnum.GENERIC_G471QETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471QETX.build.variant=STM32G4xx/G471Q(C-E)T

# Generic G471RCTx
GenG4.menu.pnum.GENERIC_G471RCTX=Generic G471RCTx
GenG4.menu.pnum.GENERIC_G471RCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471RCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471RCTX.build.board=GENERIC_G471RCTX
GenG4.menu.pnum.GENERIC_G471RCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471RCTX.build.variant=STM32G4xx/G471R(C-E)T

# Generic G471RETx
GenG4.menu.pnum.GENERIC_G471RETX=Generic G471RETx
GenG4.menu.pnum.GENERIC_G471RETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471RETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471RETX.build.board=GENERIC_G471RETX
GenG4.menu.pnum.GENERIC_G471RETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471RETX.build.variant=STM32G4xx/G471R(C-E)T

# Generic G471VCHx
GenG4.menu.pnum.GENERIC_G471VCHX=Generic G471VCHx
GenG4.menu.pnum.GENERIC_G471VCHX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCHX.build.board=GENERIC_G471VCHX
GenG4.menu.pnum.GENERIC_G471VCHX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCHX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G471VEHx
GenG4.menu.pnum.GENERIC_G471VEHX=Generic G471VEHx
GenG4.menu.pnum.GENERIC_G471VEHX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VEHX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VEHX.build.board=GENERIC_G471VEHX
GenG4.menu.pnum.GENERIC_G471VEHX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VEHX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G471VCIx
GenG4.menu.pnum.GENERIC_G471VCIX=Generic G471VCIx
GenG4.menu.pnum.GENERIC_G471VCIX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCIX.build.board=GENERIC_G471VCIX
GenG4.menu.pnum.GENERIC_G471VCIX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCIX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G471VEIx
GenG4.menu.pnum.GENERIC_G471VEIX=Generic G471VEIx
GenG4.menu.pnum.GENERIC_G471VEIX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VEIX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VEIX.build.board=GENERIC_G471VEIX
GenG4.menu.pnum.GENERIC_G471VEIX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VEIX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G471VCTx
GenG4.menu.pnum.GENERIC_G471VCTX=Generic G471VCTx
GenG4.menu.pnum.GENERIC_G471VCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G471VCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VCTX.build.board=GENERIC_G471VCTX
GenG4.menu.pnum.GENERIC_G471VCTX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VCTX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G471VETx
GenG4.menu.pnum.GENERIC_G471VETX=Generic G471VETx
GenG4.menu.pnum.GENERIC_G471VETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G471VETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G471VETX.build.board=GENERIC_G471VETX
GenG4.menu.pnum.GENERIC_G471VETX.build.product_line=STM32G471xx
GenG4.menu.pnum.GENERIC_G471VETX.build.variant=STM32G4xx/G471V(C-E)(H-I-T)

# Generic G473CBTx
GenG4.menu.pnum.GENERIC_G473CBTX=Generic G473CBTx
GenG4.menu.pnum.GENERIC_G473CBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473CBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CBTX.build.board=GENERIC_G473CBTX
GenG4.menu.pnum.GENERIC_G473CBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CBTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G473CCTx
GenG4.menu.pnum.GENERIC_G473CCTX=Generic G473CCTx
GenG4.menu.pnum.GENERIC_G473CCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473CCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CCTX.build.board=GENERIC_G473CCTX
GenG4.menu.pnum.GENERIC_G473CCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CCTX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G473CETx
GenG4.menu.pnum.GENERIC_G473CETX=Generic G473CETx
GenG4.menu.pnum.GENERIC_G473CETX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473CETX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473CETX.build.board=GENERIC_G473CETX
GenG4.menu.pnum.GENERIC_G473CETX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473CETX.build.variant=STM32G4xx/G473C(B-C-E)T_G474C(B-C-E)T_G483CET_G484CET

# Generic G473MBTx
GenG4.menu.pnum.GENERIC_G473MBTX=Generic G473MBTx
GenG4.menu.pnum.GENERIC_G473MBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G473MBTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473MBTX.build.board=GENERIC_G473MBTX
GenG4.menu.pnum.GENERIC_G473MBTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473MBTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G473MCTx
GenG4.menu.pnum.GENERIC_G473MCTX=Generic G473MCTx
GenG4.menu.pnum.GENERIC_G473MCTX.upload.maximum_size=262144
GenG4.menu.pnum.GENERIC_G473MCTX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473MCTX.build.board=GENERIC_G473MCTX
GenG4.menu.pnum.GENERIC_G473MCTX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473MCTX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

# Generic G473METx
GenG4.menu.pnum.GENERIC_G473METX=Generic G473METx
GenG4.menu.pnum.GENERIC_G473METX.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G473METX.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G473METX.build.board=GENERIC_G473METX
GenG4.menu.pnum.GENERIC_G473METX.build.product_line=STM32G473xx
GenG4.menu.pnum.GENERIC_G473METX.build.variant=STM32G4xx/G473M(B-C-E)T_G474M(B-C-E)T_G483MET_G484MET

