geosmall/Arduino_Core_STM32/boards.txt
# Generic H733ZGTx
GenH7.menu.pnum.GENERIC_H733ZGTX=Generic H733ZGTx
GenH7.menu.pnum.GENERIC_H733ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H733ZGTX.upload.maximum_data_size=327680
GenH7.menu.pnum.GENERIC_H733ZGTX.build.board=GENERIC_H733ZGTX
GenH7.menu.pnum.GENERIC_H733ZGTX.build.product_line=STM32H733xx
GenH7.menu.pnum.GENERIC_H733ZGTX.build.variant=STM32H7xx/H723Z(E-G)T_H730ZBT_H733ZGT

# Generic H742IGKx
GenH7.menu.pnum.GENERIC_H742IGKX=Generic H742IGKx
GenH7.menu.pnum.GENERIC_H742IGKX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742IGKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IGKX.build.board=GENERIC_H742IGKX
GenH7.menu.pnum.GENERIC_H742IGKX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IGKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IIKx
GenH7.menu.pnum.GENERIC_H742IIKX=Generic H742IIKx
GenH7.menu.pnum.GENERIC_H742IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IIKX.build.board=GENERIC_H742IIKX
GenH7.menu.pnum.GENERIC_H742IIKX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IGTx
GenH7.menu.pnum.GENERIC_H742IGTX=Generic H742IGTx
GenH7.menu.pnum.GENERIC_H742IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IGTX.build.board=GENERIC_H742IGTX
GenH7.menu.pnum.GENERIC_H742IGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IGTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742IITx
GenH7.menu.pnum.GENERIC_H742IITX=Generic H742IITx
GenH7.menu.pnum.GENERIC_H742IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742IITX.build.board=GENERIC_H742IITX
GenH7.menu.pnum.GENERIC_H742IITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H742VGHx
GenH7.menu.pnum.GENERIC_H742VGHX=Generic H742VGHx
GenH7.menu.pnum.GENERIC_H742VGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742VGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VGHX.build.board=GENERIC_H742VGHX
GenH7.menu.pnum.GENERIC_H742VGHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VGHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742VIHx
GenH7.menu.pnum.GENERIC_H742VIHX=Generic H742VIHx
GenH7.menu.pnum.GENERIC_H742VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VIHX.build.board=GENERIC_H742VIHX
GenH7.menu.pnum.GENERIC_H742VIHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742VGTx
GenH7.menu.pnum.GENERIC_H742VGTX=Generic H742VGTx
GenH7.menu.pnum.GENERIC_H742VGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742VGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VGTX.build.board=GENERIC_H742VGTX
GenH7.menu.pnum.GENERIC_H742VGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VGTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742VITx
GenH7.menu.pnum.GENERIC_H742VITX=Generic H742VITx
GenH7.menu.pnum.GENERIC_H742VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VITX.build.board=GENERIC_H742VITX
GenH7.menu.pnum.GENERIC_H742VITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742XGHx
GenH7.menu.pnum.GENERIC_H742XGHX=Generic H742XGHx
GenH7.menu.pnum.GENERIC_H742XGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742XGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742XGHX.build.board=GENERIC_H742XGHX
GenH7.menu.pnum.GENERIC_H742XGHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742XGHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H742XIHx
GenH7.menu.pnum.GENERIC_H742XIHX=Generic H742XIHx
GenH7.menu.pnum.GENERIC_H742XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742XIHX.build.board=GENERIC_H742XIHX
GenH7.menu.pnum.GENERIC_H742XIHX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H742ZGTx
GenH7.menu.pnum.GENERIC_H742ZGTX=Generic H742ZGTx
GenH7.menu.pnum.GENERIC_H742ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742ZGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742ZGTX.build.board=GENERIC_H742ZGTX
GenH7.menu.pnum.GENERIC_H742ZGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742ZGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H742ZITx
GenH7.menu.pnum.GENERIC_H742ZITX=Generic H742ZITx
GenH7.menu.pnum.GENERIC_H742ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742ZITX.build.board=GENERIC_H742ZITX
GenH7.menu.pnum.GENERIC_H742ZITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H743IGKx
GenH7.menu.pnum.GENERIC_H743IGKX=Generic H743IGKx
GenH7.menu.pnum.GENERIC_H743IGKX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743IGKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IGKX.build.board=GENERIC_H743IGKX
GenH7.menu.pnum.GENERIC_H743IGKX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IGKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IGTx
GenH7.menu.pnum.GENERIC_H743IGTX=Generic H743IGTx
GenH7.menu.pnum.GENERIC_H743IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IGTX.build.board=GENERIC_H743IGTX
GenH7.menu.pnum.GENERIC_H743IGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IGTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IIKx
GenH7.menu.pnum.GENERIC_H743IIKX=Generic H743IIKx
GenH7.menu.pnum.GENERIC_H743IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IIKX.build.board=GENERIC_H743IIKX
GenH7.menu.pnum.GENERIC_H743IIKX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IITx
GenH7.menu.pnum.GENERIC_H743IITX=Generic H743IITx
GenH7.menu.pnum.GENERIC_H743IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IITX.build.board=GENERIC_H743IITX
GenH7.menu.pnum.GENERIC_H743IITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743VGHx
GenH7.menu.pnum.GENERIC_H743VGHX=Generic H743VGHx
GenH7.menu.pnum.GENERIC_H743VGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743VGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VGHX.build.board=GENERIC_H743VGHX
GenH7.menu.pnum.GENERIC_H743VGHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VGHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743VIHx
GenH7.menu.pnum.GENERIC_H743VIHX=Generic H743VIHx
GenH7.menu.pnum.GENERIC_H743VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VIHX.build.board=GENERIC_H743VIHX
GenH7.menu.pnum.GENERIC_H743VIHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

