geosmall/Arduino_Core_STM32/boards.txt
# Generic H743VGTx
GenH7.menu.pnum.GENERIC_H743VGTX=Generic H743VGTx
GenH7.menu.pnum.GENERIC_H743VGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743VGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VGTX.build.board=GENERIC_H743VGTX
GenH7.menu.pnum.GENERIC_H743VGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VGTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743VITx
GenH7.menu.pnum.GENERIC_H743VITX=Generic H743VITx
GenH7.menu.pnum.GENERIC_H743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VITX.build.board=GENERIC_H743VITX
GenH7.menu.pnum.GENERIC_H743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743XGHx
GenH7.menu.pnum.GENERIC_H743XGHX=Generic H743XGHx
GenH7.menu.pnum.GENERIC_H743XGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743XGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743XGHX.build.board=GENERIC_H743XGHX
GenH7.menu.pnum.GENERIC_H743XGHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743XGHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H743XIHx
GenH7.menu.pnum.GENERIC_H743XIHX=Generic H743XIHx
GenH7.menu.pnum.GENERIC_H743XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743XIHX.build.board=GENERIC_H743XIHX
GenH7.menu.pnum.GENERIC_H743XIHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H743ZGTx
GenH7.menu.pnum.GENERIC_H743ZGTX=Generic H743ZGTx
GenH7.menu.pnum.GENERIC_H743ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743ZGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZGTX.build.board=GENERIC_H743ZGTX
GenH7.menu.pnum.GENERIC_H743ZGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H743ZITx
GenH7.menu.pnum.GENERIC_H743ZITX=Generic H743ZITx
GenH7.menu.pnum.GENERIC_H743ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZITX.build.board=GENERIC_H743ZITX
GenH7.menu.pnum.GENERIC_H743ZITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H745XGHx
GenH7.menu.pnum.GENERIC_H745XGHX=Generic H745XGHx
GenH7.menu.pnum.GENERIC_H745XGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H745XGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H745XGHX.build.board=GENERIC_H745XGHX
GenH7.menu.pnum.GENERIC_H745XGHX.build.product_line=STM32H745xG
GenH7.menu.pnum.GENERIC_H745XGHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H745XIHx
GenH7.menu.pnum.GENERIC_H745XIHX=Generic H745XIHx
GenH7.menu.pnum.GENERIC_H745XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H745XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H745XIHX.build.board=GENERIC_H745XIHX
GenH7.menu.pnum.GENERIC_H745XIHX.build.product_line=STM32H745xx
GenH7.menu.pnum.GENERIC_H745XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H747AGIx
GenH7.menu.pnum.GENERIC_H747AGIX=Generic H747AGIx
GenH7.menu.pnum.GENERIC_H747AGIX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H747AGIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747AGIX.build.board=GENERIC_H747AGIX
GenH7.menu.pnum.GENERIC_H747AGIX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747AGIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747AIIx
GenH7.menu.pnum.GENERIC_H747AIIX=Generic H747AIIx
GenH7.menu.pnum.GENERIC_H747AIIX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747AIIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747AIIX.build.board=GENERIC_H747AIIX
GenH7.menu.pnum.GENERIC_H747AIIX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747AIIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747IGTx
GenH7.menu.pnum.GENERIC_H747IGTX=Generic H747IGTx
GenH7.menu.pnum.GENERIC_H747IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H747IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747IGTX.build.board=GENERIC_H747IGTX
GenH7.menu.pnum.GENERIC_H747IGTX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747IGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747IITx
GenH7.menu.pnum.GENERIC_H747IITX=Generic H747IITx
GenH7.menu.pnum.GENERIC_H747IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747IITX.build.board=GENERIC_H747IITX
GenH7.menu.pnum.GENERIC_H747IITX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747IITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747XGHx
GenH7.menu.pnum.GENERIC_H747XGHX=Generic H747XGHx
GenH7.menu.pnum.GENERIC_H747XGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H747XGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747XGHX.build.board=GENERIC_H747XGHX
GenH7.menu.pnum.GENERIC_H747XGHX.build.product_line=STM32H747xG
GenH7.menu.pnum.GENERIC_H747XGHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H747XIHx
GenH7.menu.pnum.GENERIC_H747XIHX=Generic H747XIHx
GenH7.menu.pnum.GENERIC_H747XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H747XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747XIHX.build.board=GENERIC_H747XIHX
GenH7.menu.pnum.GENERIC_H747XIHX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX=Generic H750IBKx
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBKX.build.board=GENERIC_H750IBKX
GenH7.menu.pnum.GENERIC_H750IBKX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H750IBTx
GenH7.menu.pnum.GENERIC_H750IBTX=Generic H750IBTx
GenH7.menu.pnum.GENERIC_H750IBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBTX.build.board=GENERIC_H750IBTX
GenH7.menu.pnum.GENERIC_H750IBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX=Generic H750VBTx
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750VBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750VBTX.build.board=GENERIC_H750VBTX
GenH7.menu.pnum.GENERIC_H750VBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750VBTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

