geosmall/Arduino_Core_STM32/boards.txt
# Generic H750XBHx
GenH7.menu.pnum.GENERIC_H750XBHX=Generic H750XBHx
GenH7.menu.pnum.GENERIC_H750XBHX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750XBHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750XBHX.build.board=GENERIC_H750XBHX
GenH7.menu.pnum.GENERIC_H750XBHX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750XBHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX=Generic H750ZBTx
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750ZBTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750ZBTX.build.board=GENERIC_H750ZBTX
GenH7.menu.pnum.GENERIC_H750ZBTX.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750ZBTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX=Generic H753IIKx
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IIKX.build.board=GENERIC_H753IIKX
GenH7.menu.pnum.GENERIC_H753IIKX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX=Generic H753IITx
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753IITX.build.board=GENERIC_H753IITX
GenH7.menu.pnum.GENERIC_H753IITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX=Generic H753VIHx
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VIHX.build.board=GENERIC_H753VIHX
GenH7.menu.pnum.GENERIC_H753VIHX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX=Generic H753VITx
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753VITX.build.board=GENERIC_H753VITX
GenH7.menu.pnum.GENERIC_H753VITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H753XIHx
GenH7.menu.pnum.GENERIC_H753XIHX=Generic H753XIHx
GenH7.menu.pnum.GENERIC_H753XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753XIHX.build.board=GENERIC_H753XIHX
GenH7.menu.pnum.GENERIC_H753XIHX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX=Generic H753ZITx
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H753ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H753ZITX.build.board=GENERIC_H753ZITX
GenH7.menu.pnum.GENERIC_H753ZITX.build.product_line=STM32H753xx
GenH7.menu.pnum.GENERIC_H753ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H755XIHx
GenH7.menu.pnum.GENERIC_H755XIHX=Generic H755XIHx
GenH7.menu.pnum.GENERIC_H755XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H755XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H755XIHX.build.board=GENERIC_H755XIHX
GenH7.menu.pnum.GENERIC_H755XIHX.build.product_line=STM32H755xx
GenH7.menu.pnum.GENERIC_H755XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX=Generic H757AIIx
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757AIIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757AIIX.build.board=GENERIC_H757AIIX
GenH7.menu.pnum.GENERIC_H757AIIX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757AIIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX=Generic H757IITx
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757IITX.build.board=GENERIC_H757IITX
GenH7.menu.pnum.GENERIC_H757IITX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757IITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H757XIHx
GenH7.menu.pnum.GENERIC_H757XIHX=Generic H757XIHx
GenH7.menu.pnum.GENERIC_H757XIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H757XIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H757XIHX.build.board=GENERIC_H757XIHX
GenH7.menu.pnum.GENERIC_H757XIHX.build.product_line=STM32H757xx
GenH7.menu.pnum.GENERIC_H757XIHX.build.variant=STM32H7xx/H742X(G-I)H_H743X(G-I)H_H745X(G-I)H_H747X(G-I)H_H750XBH_H753XIH_H755XIH_H757XIH

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic Flight Controllers

