geosmall/Arduino_Core_STM32/boards.txt
GenF7.menu.usb.none=None
GenF7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenF7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenF7.menu.usb.CDC=CDC (no generic 'Serial')
GenF7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenF7.menu.usb.HID=HID (keyboard and mouse)
GenF7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenF7.menu.xusb.FS=Low/Full Speed
GenF7.menu.xusb.HS=High Speed
GenF7.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenF7.menu.xusb.HSFS=High Speed in Full Speed mode
GenF7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenG4.menu.usb.none=None
GenG4.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenG4.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenG4.menu.usb.CDC=CDC (no generic 'Serial')
GenG4.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenG4.menu.usb.HID=HID (keyboard and mouse)
GenG4.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenG4.menu.xusb.FS=Low/Full Speed
GenG4.menu.xusb.HS=High Speed
GenG4.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenG4.menu.xusb.HSFS=High Speed in Full Speed mode
GenG4.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenH7.menu.usb.none=None
GenH7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenH7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenH7.menu.usb.CDC=CDC (no generic 'Serial')
GenH7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenH7.menu.usb.HID=HID (keyboard and mouse)
GenH7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenH7.menu.xusb.FS=Low/Full Speed
GenH7.menu.xusb.HS=High Speed
GenH7.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenH7.menu.xusb.HSFS=High Speed in Full Speed mode
GenH7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenFlight.menu.usb.none=None
GenFlight.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenFlight.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenFlight.menu.usb.CDC=CDC (no generic 'Serial')
GenFlight.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenFlight.menu.usb.HID=HID (keyboard and mouse)
GenFlight.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenFlight.menu.xusb.FS=Low/Full Speed
GenFlight.menu.xusb.HS=High Speed
GenFlight.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenFlight.menu.xusb.HSFS=High Speed in Full Speed mode
GenFlight.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.ogstd=Debug (-Og)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_144.menu.opt.o0std=No Optimization (-O0)
Nucleo_144.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.ogstd=Debug (-Og)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_64.menu.opt.o0std=No Optimization (-O0)
Nucleo_64.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.ogstd=Debug (-Og)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_32.menu.opt.o0std=No Optimization (-O0)
Nucleo_32.menu.opt.o0std.build.flags.optimize=-O0

Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.ogstd=Debug (-Og)
Disco.menu.opt.ogstd.build.flags.optimize=-Og
Disco.menu.opt.o0std=No Optimization (-O0)
Disco.menu.opt.o0std.build.flags.optimize=-O0

GenF4.menu.opt.osstd=Smallest (-Os default)
GenF4.menu.opt.oslto=Smallest (-Os) with LTO
GenF4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF4.menu.opt.o1std=Fast (-O1)
GenF4.menu.opt.o1std.build.flags.optimize=-O1
GenF4.menu.opt.o1lto=Fast (-O1) with LTO
GenF4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF4.menu.opt.o2std=Faster (-O2)
GenF4.menu.opt.o2std.build.flags.optimize=-O2
GenF4.menu.opt.o2lto=Faster (-O2) with LTO
GenF4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF4.menu.opt.o3std=Fastest (-O3)
GenF4.menu.opt.o3std.build.flags.optimize=-O3
GenF4.menu.opt.o3lto=Fastest (-O3) with LTO
GenF4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF4.menu.opt.ogstd=Debug (-Og)
GenF4.menu.opt.ogstd.build.flags.optimize=-Og
GenF4.menu.opt.o0std=No Optimization (-O0)
GenF4.menu.opt.o0std.build.flags.optimize=-O0

GenF7.menu.opt.osstd=Smallest (-Os default)
GenF7.menu.opt.oslto=Smallest (-Os) with LTO
GenF7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF7.menu.opt.o1std=Fast (-O1)
GenF7.menu.opt.o1std.build.flags.optimize=-O1
GenF7.menu.opt.o1lto=Fast (-O1) with LTO
GenF7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF7.menu.opt.o2std=Faster (-O2)
GenF7.menu.opt.o2std.build.flags.optimize=-O2
GenF7.menu.opt.o2lto=Faster (-O2) with LTO
GenF7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF7.menu.opt.o3std=Fastest (-O3)
GenF7.menu.opt.o3std.build.flags.optimize=-O3
GenF7.menu.opt.o3lto=Fastest (-O3) with LTO
GenF7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF7.menu.opt.ogstd=Debug (-Og)
GenF7.menu.opt.ogstd.build.flags.optimize=-Og
GenF7.menu.opt.o0std=No Optimization (-O0)
GenF7.menu.opt.o0std.build.flags.optimize=-O0

GenG4.menu.opt.osstd=Smallest (-Os default)
GenG4.menu.opt.oslto=Smallest (-Os) with LTO
GenG4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenG4.menu.opt.o1std=Fast (-O1)
GenG4.menu.opt.o1std.build.flags.optimize=-O1
GenG4.menu.opt.o1lto=Fast (-O1) with LTO
GenG4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenG4.menu.opt.o2std=Faster (-O2)
GenG4.menu.opt.o2std.build.flags.optimize=-O2
GenG4.menu.opt.o2lto=Faster (-O2) with LTO
GenG4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenG4.menu.opt.o3std=Fastest (-O3)
GenG4.menu.opt.o3std.build.flags.optimize=-O3
GenG4.menu.opt.o3lto=Fastest (-O3) with LTO
GenG4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenG4.menu.opt.ogstd=Debug (-Og)
GenG4.menu.opt.ogstd.build.flags.optimize=-Og
GenG4.menu.opt.o0std=No Optimization (-O0)
GenG4.menu.opt.o0std.build.flags.optimize=-O0

GenH7.menu.opt.osstd=Smallest (-Os default)
GenH7.menu.opt.oslto=Smallest (-Os) with LTO
GenH7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH7.menu.opt.o1std=Fast (-O1)
GenH7.menu.opt.o1std.build.flags.optimize=-O1
GenH7.menu.opt.o1lto=Fast (-O1) with LTO
GenH7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH7.menu.opt.o2std=Faster (-O2)
GenH7.menu.opt.o2std.build.flags.optimize=-O2
GenH7.menu.opt.o2lto=Faster (-O2) with LTO
GenH7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH7.menu.opt.o3std=Fastest (-O3)
GenH7.menu.opt.o3std.build.flags.optimize=-O3
GenH7.menu.opt.o3lto=Fastest (-O3) with LTO
GenH7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenH7.menu.opt.ogstd=Debug (-Og)
GenH7.menu.opt.ogstd.build.flags.optimize=-Og
GenH7.menu.opt.o0std=No Optimization (-O0)
GenH7.menu.opt.o0std.build.flags.optimize=-O0

