geosmall/Arduino_Core_STM32/boards.txt
GenFlight.menu.opt.osstd=Smallest (-Os default)
GenFlight.menu.opt.oslto=Smallest (-Os) with LTO
GenFlight.menu.opt.oslto.build.flags.optimize=-Os -flto
GenFlight.menu.opt.o1std=Fast (-O1)
GenFlight.menu.opt.o1std.build.flags.optimize=-O1
GenFlight.menu.opt.o1lto=Fast (-O1) with LTO
GenFlight.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenFlight.menu.opt.o2std=Faster (-O2)
GenFlight.menu.opt.o2std.build.flags.optimize=-O2
GenFlight.menu.opt.o2lto=Faster (-O2) with LTO
GenFlight.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenFlight.menu.opt.o3std=Fastest (-O3)
GenFlight.menu.opt.o3std.build.flags.optimize=-O3
GenFlight.menu.opt.o3lto=Fastest (-O3) with LTO
GenFlight.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenFlight.menu.opt.ogstd=Debug (-Og)
GenFlight.menu.opt.ogstd.build.flags.optimize=-Og
GenFlight.menu.opt.o0std=No Optimization (-O0)
GenFlight.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_144.menu.dbg.enable_log=Core logs Enabled
Nucleo_144.menu.dbg.enable_log.build.flags.debug=
Nucleo_144.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_64.menu.dbg.enable_log=Core logs Enabled
Nucleo_64.menu.dbg.enable_log.build.flags.debug=
Nucleo_64.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_32.menu.dbg.none=None
Nucleo_32.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_32.menu.dbg.enable_log=Core logs Enabled
Nucleo_32.menu.dbg.enable_log.build.flags.debug=
Nucleo_32.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_all.build.flags.debug=-g

Disco.menu.dbg.none=None
Disco.menu.dbg.enable_sym=Symbols Enabled (-g)
Disco.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Disco.menu.dbg.enable_log=Core logs Enabled
Disco.menu.dbg.enable_log.build.flags.debug=
Disco.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Disco.menu.dbg.enable_all.build.flags.debug=-g

GenF4.menu.dbg.none=None
GenF4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF4.menu.dbg.enable_log=Core logs Enabled
GenF4.menu.dbg.enable_log.build.flags.debug=
GenF4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF4.menu.dbg.enable_all.build.flags.debug=-g

GenF7.menu.dbg.none=None
GenF7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF7.menu.dbg.enable_log=Core logs Enabled
GenF7.menu.dbg.enable_log.build.flags.debug=
GenF7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF7.menu.dbg.enable_all.build.flags.debug=-g

GenG4.menu.dbg.none=None
GenG4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenG4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenG4.menu.dbg.enable_log=Core logs Enabled
GenG4.menu.dbg.enable_log.build.flags.debug=
GenG4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenG4.menu.dbg.enable_all.build.flags.debug=-g

GenH7.menu.dbg.none=None
GenH7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenH7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenH7.menu.dbg.enable_log=Core logs Enabled
GenH7.menu.dbg.enable_log.build.flags.debug=
GenH7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenH7.menu.dbg.enable_all.build.flags.debug=-g

GenFlight.menu.dbg.none=None
GenFlight.menu.dbg.enable_sym=Symbols Enabled (-g)
GenFlight.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenFlight.menu.dbg.enable_log=Core logs Enabled
GenFlight.menu.dbg.enable_log.build.flags.debug=
GenFlight.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenFlight.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

Disco.menu.rtlib.nano=Newlib Nano (default)
Disco.menu.rtlib.nanofp=Newlib Nano + Float Printf
Disco.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Disco.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Disco.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Disco.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Disco.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Disco.menu.rtlib.full=Newlib Standard
Disco.menu.rtlib.full.build.flags.ldspecs=

GenF4.menu.rtlib.nano=Newlib Nano (default)
GenF4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF4.menu.rtlib.full=Newlib Standard
GenF4.menu.rtlib.full.build.flags.ldspecs=

GenF7.menu.rtlib.nano=Newlib Nano (default)
GenF7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF7.menu.rtlib.full=Newlib Standard
GenF7.menu.rtlib.full.build.flags.ldspecs=

GenG4.menu.rtlib.nano=Newlib Nano (default)
GenG4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenG4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenG4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenG4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenG4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenG4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenG4.menu.rtlib.full=Newlib Standard
GenG4.menu.rtlib.full.build.flags.ldspecs=

GenH7.menu.rtlib.nano=Newlib Nano (default)
GenH7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH7.menu.rtlib.full=Newlib Standard
GenH7.menu.rtlib.full.build.flags.ldspecs=

GenFlight.menu.rtlib.nano=Newlib Nano (default)
GenFlight.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenFlight.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenFlight.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenFlight.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenFlight.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenFlight.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenFlight.menu.rtlib.full=Newlib Standard
GenFlight.menu.rtlib.full.build.flags.ldspecs=
